performance/results/load_test_summary.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
Request vào trang Login ,500,1505,106,5322,822.59,0.000%,4.69867,11.83,4.21,2578.0
Debug Sampler,500,0,0,3,0.40,0.000%,4.70345,2.10,0.00,457.2
Request gửi User/Pass,500,4177,823,12279,1957.28,0.000%,4.66731,12.68,5.99,2783.0
Request vào trang PIM,500,1556,222,5161,751.23,0.000%,4.69404,13.20,4.51,2879.0
Request Search,500,791,98,3010,473.52,0.000%,4.69947,5.43,2.41,1184.2
Requesr Employee,500,757,99,2677,439.65,0.000%,4.69881,2.34,2.76,510.0
End,500,348,193,1459,193.53,0.000%,4.69409,1.31,2.50,286.0
flow,500,9136,1732,18646,2989.48,0.000%,4.62295,48.20,22.06,10677.4
TOTAL,4000,2284,0,18646,3155.53,0.000%,36.98362,96.41,44.12,2669.3